Revit 2024 API
FormulaEditingEventArgs Properties
The FormulaEditingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
CurrentDocument
 Returns the current document
Formula
 Returns text of the formula that will be modified
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
ParameterId
 Returns the Id of the modified parameter
See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace